In [2]:
import pandas as pd
import datetime as dt
pivot_data = [{'name': ' Dan ', 'date': '14 -6 -2021', 'sales': 11},
        {'name': 'Harris', 'date': '14-6-2021', 'sales':37 },
        {'name': 'Joe ', 'date': '14-6-2021', 'sales': 85},
        {'name': 'John', 'date':'14-6-2021' , 'sales':63 },
        {'name': 'Dan ', 'date':' 14-6-2021', 'sales': 16},
        {'name': 'Harris', 'date':'13-6-2021' , 'sales':73},
        {'name': 'Joe ', 'date':'13-6-2021', 'sales':20 },
        {'name': 'John ', 'date':'13-6-2021' , 'sales':73},
        {'name': 'Dan ', 'date':'12-6-2021', 'sales':68},
        {'name': 'Harris ', 'date':'12-6-2021', 'sales':33},
        {'name': 'Joe ', 'date':' 12-6-2022', 'sales': 62},
        {'name': 'John ', 'date':'12-6-2021 ', 'sales':31 },
            ]
df = pd.DataFrame(pivot_data)
df

       name         date  sales
0      Dan   14 -6 -2021     11
1    Harris    14-6-2021     37
2      Joe     14-6-2021     85
3      John    14-6-2021     63
4      Dan     14-6-2021     16
5    Harris    13-6-2021     73
6      Joe     13-6-2021     20
7     John     13-6-2021     73
8      Dan     12-6-2021     68
9   Harris     12-6-2021     33
10     Joe     12-6-2022     62
11    John    12-6-2021      31

In [3]:
df = pd.DataFrame(pivot_data)
print(df)

       name         date  sales
0      Dan   14 -6 -2021     11
1    Harris    14-6-2021     37
2      Joe     14-6-2021     85
3      John    14-6-2021     63
4      Dan     14-6-2021     16
5    Harris    13-6-2021     73
6      Joe     13-6-2021     20
7     John     13-6-2021     73
8      Dan     12-6-2021     68
9   Harris     12-6-2021     33
10     Joe     12-6-2022     62
11    John    12-6-2021      31

In [4]:
df1=df.pivot(index="name", columns="date", values="sales")
print(df1)

date      12-6-2022   14-6-2021  12-6-2021  12-6-2021   13-6-2021  \
name
 Dan            NaN         NaN        NaN         NaN        NaN
Dan             NaN        16.0       68.0         NaN        NaN
Harris          NaN         NaN        NaN         NaN       73.0
Harris          NaN         NaN       33.0         NaN        NaN
Joe            62.0         NaN        NaN         NaN       20.0
John            NaN         NaN        NaN         NaN        NaN
John            NaN         NaN        NaN        31.0       73.0

date     14 -6 -2021  14-6-2021
name
 Dan            11.0        NaN
Dan              NaN        NaN
Harris           NaN       37.0
Harris           NaN        NaN
Joe              NaN       85.0
John             NaN       63.0
John             NaN        NaN

In [5]:
import pandas as pd
import datetime as dt
pivot_data = [{'Name': 'John', 'date': '14 -6 -2021', 'sales': 11},
        {'Name': 'Harris', 'date': '14-6-2021', 'sales':37 },
        {'Name': 'sev', 'date': '14-6-2021', 'sales': 85},
        {'Name': 'Joe', 'date':'14-6-2021' , 'sales':63 }
            ]
df4 = pd.DataFrame(pivot_data)
df4

     Name         date  sales
0    John  14 -6 -2021     11
1  Harris    14-6-2021     37
2     sev    14-6-2021     85
3     Joe    14-6-2021     63

In [7]:
df5 = df4.melt(id_vars=["Name"])
print(df5)

     Name variable        value
0    John     date  14 -6 -2021
1  Harris     date    14-6-2021
2     sev     date    14-6-2021
3     Joe     date    14-6-2021
4    John    sales           11
5  Harris    sales           37
6     sev    sales           85
7     Joe    sales           63